{"_id":{"$oid":"5703d372e4b0b080c4f3716b"},"imgCondition":"c","submitTime":{"$numberLong":"1459868529551"},"elapsedTime":"319.14","code":679,"myVals":{"val":"the idea of this application is unique, it seems like a social networking site. how the bank details of person is secure? is there is enough privacy policies to protect the data from public? the page design is simple, understandable and easy to follow. it is visually appealing."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703dcf5e4b0b080c4f42dbc"},"imgCondition":"c","submitTime":{"$numberLong":"1459870956953"},"elapsedTime":"236.40","code":690,"myVals":{"val":"A panel on the right side of the page which will enable the user to have a better control over the financial data. At the same time there is not data showing the history or rating of the friend."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703ee85e4b0b080c4f565af"},"imgCondition":"c","submitTime":{"$numberLong":"1459875456522"},"elapsedTime":"823.79","code":699,"myVals":{"val":"Only name of the payee and received is specified but here the user photo and other identification mark can be included in order to improve the transaction effectively and safely"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f146e4b0b080c4f59923"},"imgCondition":"c","submitTime":{"$numberLong":"1459876164783"},"elapsedTime":"272.71","code":720,"myVals":{"val":"The design and layout is not much attracting,can be given a good color background.The money transfers are public so it may hamper the privacy of the sender and receiver,so the aspect of privacy should be demonstrated or used."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f236e4b0ddfe7a26560c"},"imgCondition":"c","submitTime":{"$numberLong":"1459876406229"},"elapsedTime":"73.42","code":732,"myVals":{"val":"I like to venmo queen"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f394e4b0ddfe7a266462"},"imgCondition":"c","submitTime":{"$numberLong":"1459876755812"},"elapsedTime":"162.46","code":763,"myVals":{"val":"It looks easy to use. I was a little confused by the term \"charge\", you mean you are asking those people for money? Is there another word or phrase that could be used?\nIt seems like a good tool for collecting money. Could you include groups and budgets, such as for a party or group trip?"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f4b5e4b0ddfe7a266f3f"},"imgCondition":"c","submitTime":{"$numberLong":"1459877045184"},"elapsedTime":"7.04","code":781,"myVals":{"val":""},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f5a2e4b0b080c4f622c6"},"imgCondition":"c","submitTime":{"$numberLong":"1459877183283"},"elapsedTime":"227.78","code":796,"myVals":{"val":"The design has no security.  Before transferring money privacy must be provided and money transfer must be in secure mode. Here it is very critical. Please take it in to consideration."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f6a5e4b0b080c4f62e3e"},"imgCondition":"c","submitTime":{"$numberLong":"1459877539653"},"elapsedTime":"356.25","code":804,"myVals":{"val":"I feel the Pay \u0026 Charge tabs should be bigger in size. That just helps a new person understand the important tabs they need to use.You could also display a list of friends on the page whom they can transfer readily. Something where they can just tick the name \u0026 transfer the money cause people generally look at the ease of using the page as well. "},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f7d1e4b0ddfe7a269171"},"imgCondition":"c","submitTime":{"$numberLong":"1459877779223"},"elapsedTime":"304.78","code":813,"myVals":{"val":"Pending and approved Transaction label. A chat window to see our freinds list. A green icon next to the logged in user , to see if he is online right now. \n"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f832e4b0ddfe7a2694ac"},"imgCondition":"c","submitTime":{"$numberLong":"1459877938641"},"elapsedTime":"116.23","code":822,"myVals":{"val":"It looks to me like a good design.  It looks user friendly.  I think it would be a good app to have!"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f8c7e4b0b080c4f64515"},"imgCondition":"c","submitTime":{"$numberLong":"1459878087207"},"elapsedTime":"77.67","code":826,"myVals":{"val":"Just link contact from social sites and improving in user interface making it more appealing by adding animation "},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f96be4b0b080c4f64ac3"},"imgCondition":"c","submitTime":{"$numberLong":"1459878246292"},"elapsedTime":"61.00","code":842,"myVals":{"val":"I think it would be more effective and efficient to list paid/charged status in different colors, to promote at-a-glance recognition."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703fa91e4b0b080c4f658d9"},"imgCondition":"c","submitTime":{"$numberLong":"1459878546589"},"elapsedTime":"65.27","code":856,"myVals":{"val":"Chatting dashboard can be changed to money conversion rates from one place to another or one country to another can be displayed"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703fd94e4b0ddfe7a26d108"},"imgCondition":"c","submitTime":{"$numberLong":"1459879311200"},"elapsedTime":"76.45","code":881,"myVals":{"val":"The design was exclusive and extraordinary.It is too difficult for anyone too handle."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703ff83e4b0ddfe7a26e3cd"},"imgCondition":"c","submitTime":{"$numberLong":"1459966211709"},"elapsedTime":"194.65","code":889,"myVals":{"val":"This design is pretty basic and has a great layout to it. I like this format and layout for this webpage because its easy to read and understand. There is not a lot of bulk categories that would have you confused about were to navigate to. That's what makes this design good."},"vals":[],"stack":[]}
{"_id":{"$oid":"57043ea3e4b0b080c4fa2ce2"},"imgCondition":"c","submitTime":{"$numberLong":"1459895958184"},"elapsedTime":"260.04","code":971,"myVals":{"val":"Finally, this is much better than using paypal to send money. Make sure pay and charge has a limit set for it so users can't accidentally enter an extremely high amount by accident. I don't see an option near it to pick who I want to send money to or charge. So maybe a list of your friends to choose from would be helpful. Maybe doing it via their profile would be okay, too. The invitation to friends makes me question whether or not it works because it's just text you click when a button is generally used for a form. I'm not sure what the checklist is for either, but that's another story."},"vals":[],"stack":[]}
{"_id":{"$oid":"57043ed8e4b0b080c4fa2eba"},"imgCondition":"c","submitTime":{"$numberLong":"1459896012525"},"elapsedTime":"234.07","code":972,"myVals":{"val":"The overall design is bland. The colors are too muted and somber. The social media icons are defaults and are too generic. There needs to be some texture to the background and a more interesting font used. It needs character and the sense that it was created by a human being and not simply typed into an existing website template. The upper banner needs some depth and the logo is a bit too flat looking also and needs a gradient or something to make it more visually interesting.."},"vals":[],"stack":[]}
{"_id":{"$oid":"57045f98e4b00372f44da935"},"imgCondition":"c","submitTime":{"$numberLong":"1459904398269"},"elapsedTime":"105.85","code":1014,"myVals":{"val":"At first glance, I am a little confused to be honest. I am not 100% sure of the concept. I get that you can request money from others or pay others. It seems like a twitter or facebook except it is to send/receive money. I think the concept appears simple but I'm not sure how many people would want a public newsfeed of this. "},"vals":[],"stack":[]}
{"_id":{"$oid":"57046951e4b00372f44e05b0"},"imgCondition":"c","submitTime":{"$numberLong":"1459906895600"},"elapsedTime":"75.47","code":1027,"myVals":{"val":"I think a little more color besides black and green would improve things somewhat. The design is very dull. "},"vals":[],"stack":[]}
