{"_id":{"$oid":"5703d4b1e4b0b080c4f37e58"},"imgCondition":"a","submitTime":{"$numberLong":"1459868845724"},"elapsedTime":"669.18","code":686,"myVals":{"val":"The logo must  come at top before title and it must be large. The sentence written at the bottom should be brightened.\nDANCE should be of different colour. There should be a name and contact details of a person to contact. Optional: A slogan can be added."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703d5e3e4b0ddfe7a244344"},"imgCondition":"a","submitTime":{"$numberLong":"1459869157804"},"elapsedTime":"348.30","code":687,"myVals":{"val":"I would like a space between dance and sport. When it's together like that, it's hard to read. Also, the color for the text of Open House 2015 and the other texts that match that color would look better if the text color was white. It will be bright and stand out more. Last, in the section that says Join us for an evening of...after that, I would put a :, then a dash, etc. Below is an example of how I would do it.\n\nJoin us for an evening of:\n-dance performances\n-FREE dance lessons\nShowcasing 4 styles of ballroom dance!"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f2a3e4b0b080c4f5aa5d"},"imgCondition":"a","submitTime":{"$numberLong":"1459876519036"},"elapsedTime":"30.20","code":745,"myVals":{"val":"The design is good, but the graphic could be cleaned up a bit. It is a little choppy and hte corners aren't smooth. "},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f2a6e4b0ddfe7a265a4e"},"imgCondition":"a","submitTime":{"$numberLong":"1459876516873"},"elapsedTime":"404.59","code":746,"myVals":{"val":"The ad is very attractive, I love the purple over the black. It is a very sleek and stylish but still simple and easy to understand.  Not too much information or clutter but enough to draw interest."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f30ae4b0b080c4f5aeba"},"imgCondition":"a","submitTime":{"$numberLong":"1459876618276"},"elapsedTime":"292.75","code":754,"myVals":{"val":"I give the design an overall 7 out of 10. The purple is eye-catching. The flow is pleasing on the eye. The information is easy to find once I decide I want to attend. The graphic conveys dance appropriately. The logo is not tacky or in-your-face, but appropriately placed. \n\nTo improve the design, I would provide contact information. I would also replace \"Time/Place\" with something less cumbersome. Perhaps, \"Location.\"  I would also left justify the location details so as not to detract from the graphic of the people dancing. "},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f336e4b0ddfe7a26604d"},"imgCondition":"a","submitTime":{"$numberLong":"1459876658785"},"elapsedTime":"118.68","code":757,"myVals":{"val":"The words Illini Dancesport Dance Open House 2015 needs to be centered better on the page. It feels odd, particularly with that large empty space under the word Dancesport. The colors are good, but the text needs a better layout. I'd consider maybe moving the logo under Illini to a different part of the image and then centering the main title. I'd also add some bolding to words like Time/Place and anything else that needs to stand out so make it easier to read."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f428e4b0ddfe7a266a98"},"imgCondition":"a","submitTime":{"$numberLong":"1459877206764"},"elapsedTime":"419.29","code":768,"myVals":{"val":"The Poster design is short and simple. This poster shows every information about the dance show but it is slightly less attractive. Can improve the attractiveness of the poster by giving some colorful outline borders."},"vals":[],"stack":[]}
{"_id":{"$oid":"57040d73e4b0b080c4f77fb4"},"imgCondition":"a","submitTime":{"$numberLong":"1459883427768"},"elapsedTime":"84.36","code":917,"myVals":{"val":"I like the colors, but would make the silhouettes black  and choose a different background color to avoid the \"floating hand effect.\" Otherwise, I'd continue to use the purple, but would fill in the male dancer's collar, tie, and hand, so that it's a true silhouette. "},"vals":[],"stack":[]}
{"_id":{"$oid":"570410b9e4b0ddfe7a27f72a"},"imgCondition":"a","submitTime":{"$numberLong":"1459884215553"},"elapsedTime":"212.55","code":921,"myVals":{"val":"I think it would be better if the woman's shadow was a different color. The man and woman sort of collide and make them somewhat indistinguishable. The font is okay, but I might play with different font styles to see if I could find something classier looking. Other than that, it's a good poster. I like it. Eye catching."},"vals":[],"stack":[]}
{"_id":{"$oid":"5704195ee4b0ddfe7a285d6a"},"imgCondition":"a","submitTime":{"$numberLong":"1459886426560"},"elapsedTime":"268.34","code":928,"myVals":{"val":"Most of it is rather good,a lthough there's something about the word \"DANCE\" and the picture of the couple dancing itself that seems a little off. For some reason it looks sloppy, and the choice of the shade of purple isn't all that appealing. The font for DANCE also isn't great, though I do agree it should be bolded and thick lettering. The purple would probably be best if it were changed to another color, perhaps somewhere between robin egg blue or teal? If you want to keep a cooler shade that is. A warm shade could also be good, and it'd capture your eye immediately against the dark black background. If you WERE to change the color to something warm, I'd recommend a yellow or an orange, which would also fit well because the date of the event is nearing the end of summer/beginning of fall and orange and yellow are good fall and summer colors. "},"vals":[],"stack":[]}
{"_id":{"$oid":"57041b0fe4b0ddfe7a286d63"},"imgCondition":"a","submitTime":{"$numberLong":"1459886871443"},"elapsedTime":"113.62","code":931,"myVals":{"val":"I would align the time and dates to the left instead of the right.  Also changing the image of the dancers. Outline them or add more colors"},"vals":[],"stack":[]}
{"_id":{"$oid":"57041c48e4b0b080c4f82c68"},"imgCondition":"a","submitTime":{"$numberLong":"1459887123401"},"elapsedTime":"94.03","code":933,"myVals":{"val":"I think the purple really draws the attention. It is easy to know this is for dancing and the wording flows very nicely."},"vals":[],"stack":[]}
{"_id":{"$oid":"5704340de4b0ddfe7a29bf97"},"imgCondition":"a","submitTime":{"$numberLong":"1459893263546"},"elapsedTime":"364.60","code":955,"myVals":{"val":"I love everything about this exept for the placing of the time/place... not the Time/Place: at the top but rather the actual listings of them. I think they are to far to the middle I would have then listed directly below the time/place: ."},"vals":[],"stack":[]}
{"_id":{"$oid":"57043df5e4b0b080c4fa288a"},"imgCondition":"a","submitTime":{"$numberLong":"1459895797999"},"elapsedTime":"105.36","code":968,"myVals":{"val":"I like the layout, but I don't like the purple.  It makes the whole thing look dark.  I think if it had some brighter colors it would stand out more and catch peoples attention.  Maybe the time and place should be a little bigger also.  That should be the main focus in my opinion."},"vals":[],"stack":[]}
{"_id":{"$oid":"570460ece4b000c454af98f0"},"imgCondition":"a","submitTime":{"$numberLong":"1459904793397"},"elapsedTime":"381.47","code":1016,"myVals":{"val":"The design is very attractive and colorful. The purple color makes it unique and more appealing to me. And the combination of a black background, purple and yellow is strikingly beautiful. None of the colors are blinding. The poster does a great job at alternating the font size and boldness. The poster mentions all the information that I like to read in such posters, including the exact date, time and place. And it mentions what it could be expected by attending the dance show including the free dance lessons with 4 styles of ballroom dance. I sincerely like the poster."},"vals":[],"stack":[]}
{"_id":{"$oid":"57048a7be4b00372f44fe92c"},"imgCondition":"a","submitTime":{"$numberLong":"1459915387383"},"elapsedTime":"292.20","code":1065,"myVals":{"val":"The text beginning with \"Join us...\" is harder to read because of font color. I like the design of the couple dancing; it's intriguing and let's me know what to expect. \"Location TBD\" is off-putting. When will the location be determined, and how will that information be communicated? I'm not crazy about the contrasting justification of the text blocks beginning with \"7 p.m. Friday...\" and \"Join us...\"; it looks a bit sloppy."},"vals":[],"stack":[]}
{"_id":{"$oid":"57048dece4b00372f450015e"},"imgCondition":"a","submitTime":{"$numberLong":"1459916281411"},"elapsedTime":"61.52","code":1071,"myVals":{"val":"Looks outdated. Background colors of black and purple are not eye-catching. Information is hard to see, needs larger font. "},"vals":[],"stack":[]}
{"_id":{"$oid":"57049064e4b000c454b1f375"},"imgCondition":"a","submitTime":{"$numberLong":"1459916898764"},"elapsedTime":"140.77","code":1075,"myVals":{"val":"I really like the poster, but I think it would be beneficial to change the font size of the date and time to something that stands out (a bright, bold font would work well).  Also, the September 1st date should really have a location prior to printing and hanging the posters.  Finally, the text at the bottom is very difficult to read due to the color of the font - that should be brightened."},"vals":[],"stack":[]}
{"_id":{"$oid":"5704a5c6e4b000c454b26562"},"imgCondition":"a","submitTime":{"$numberLong":"1459922464214"},"elapsedTime":"79.35","code":1103,"myVals":{"val":"Very interesting design. Contrast colors attract attention. I may propose to change text layout for better separation of information"},"vals":[],"stack":[]}
{"_id":{"$oid":"5704c09de4b00372f451f53f"},"imgCondition":"a","submitTime":{"$numberLong":"1459929241837"},"elapsedTime":"299.55","code":1137,"myVals":{"val":"Dance open house 2015 must be written in same colour(violet). In 7 pm Friday August 28 7 I'd not clearclear. While providing address please include the city and state for more proper address "},"vals":[],"stack":[]}
{"_id":{"$oid":"5704c181e4b000c454b32b22"},"imgCondition":"a","submitTime":{"$numberLong":"1459929494842"},"elapsedTime":"238.48","code":1139,"myVals":{"val":"I can see the white spots from editing the purple/black cut-outs of the people that are dancing. I'm not sure if it's just the tint from my computer screen, but the color of \"OPEN HOUSE 2015\" is not a pleasant color to look at. It hurts my eyes and would immediately make me want to stop looking at it. I would suggest making that specific text a little bit darker to seem more appealing."},"vals":[],"stack":[]}
{"_id":{"$oid":"5704d99fe4b0801e3050bd06"},"imgCondition":"a","submitTime":{"$numberLong":"1459935687020"},"elapsedTime":"352.99","code":1159,"myVals":{"val":"The color scheme of the design needs a little bit improvement. See various poster in Google you will find the best color schemes. In this color scheme you want to keep black background, then you should also present some part of the poster in shining pink colors. There is no shine as this is a ball room dance program. See the url image below, you will get more clear idea of color schemes.\n\nUrl: http://www.utahballroom.org/files/concerts/2008/UVU_WinterConcert08_Poster.jpg"},"vals":[],"stack":[]}
{"_id":{"$oid":"5704f289e4b0801e3051a9f1"},"imgCondition":"a","submitTime":{"$numberLong":"1459942018050"},"elapsedTime":"221.34","code":1180,"myVals":{"val":"Looking nice design. In my suggestion Please try to different font on (\" Join us .... across 4 styles of ballroom Dance!\"). Please highlight this. Time and place put in to bottom. Also, Logo much bigger its good."},"vals":[],"stack":[]}
