{"_id":{"$oid":"5703d26be4b0ddfe7a241eff"},"imgCondition":"b","submitTime":{"$numberLong":"1459868266520"},"elapsedTime":"87.28","code":666,"myVals":{"val":"The design is well done in my opinion. I like the earthy tones of colors used for the site for Parkland College. Its very welcoming and easy to navigate from the looks of it. I feel the design is going to make it easy on the consumers eyes and make it an easy experience to use. "},"vals":[],"stack":[]}
{"_id":{"$oid":"5703dfd6e4b0ddfe7a24b730"},"imgCondition":"b","submitTime":{"$numberLong":"1459871706801"},"elapsedTime":"210.50","code":692,"myVals":{"val":"The \"information for\" section is too big, maybe make it a little smaller. Also, the news and campus events section has font too small. Make it a little bigger and it would be great. Another thing might be to get rid of a little of the green, seems like there is too much there. Maybe move the ads to the top of the page so they don't interfere with the information sections. Make the Contact us section more readily available as it can not be seen on the page as well as other sections. The font in the top where you choose a section seems a bit too basic, add a new style to it and make it a little more stylish. Make the background look more modern, it looks more like a blog than it does a website as is right now."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f2cbe4b0ddfe7a265bd0"},"imgCondition":"b","submitTime":{"$numberLong":"1459876721195"},"elapsedTime":"128.11","code":749,"myVals":{"val":"The design is average i feel. I think the color scheme could have make better. The font can also be changed to make a good feel. "},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f450e4b0b080c4f5be1b"},"imgCondition":"b","submitTime":{"$numberLong":"1459877043144"},"elapsedTime":"497.26","code":774,"myVals":{"val":"Way too busy and too much information for homepage. Also, I don't see this appealing to community college students... no marketing appeal to that demographic. I would change the colors (this looks like hospital green); maybe black and white with splashes of color; I would go with a more graphic book type of look.  I would totally eliminate the left hand bottom quarter (Go ahead...) square, just keep the \"go ahead, visit us!\" link. I would retain \"in the news\" link but eliminate the links under it... same for campus events. I like the photo but maybe incorporate her picture into a photo of 3 or 4 students to represent community and diversity. In the \"information\" square I would move\"coming to Parkland\" to be first, and \"Information\" second. All in all I would cut down the amount of verbal information on this first page by at least 50%."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f5cee4b0ddfe7a267abb"},"imgCondition":"b","submitTime":{"$numberLong":"1459877325332"},"elapsedTime":"80.67","code":799,"myVals":{"val":"The white on green is a good contradiction in colors, but the print is so small it's hard to read. Maybe the letter should be enlarged, or in bold to emphasize. Other than that, the design is minimalist is nature, and it works great. It's easy to see the flow of the page, and is not intrusive."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703f9ace4b0ddfe7a26a283"},"imgCondition":"b","submitTime":{"$numberLong":"1459878309626"},"elapsedTime":"187.24","code":845,"myVals":{"val":"There should be pictures of college n the picture of  an infrastructure of college.seeing the different area of college student will get more idea about yhe college n its facilities like sports ground ,cantiness ,lab etc .it should mention the names of top students n rewiews for better understanding of college .the design in other ways is good "},"vals":[],"stack":[]}
{"_id":{"$oid":"5703fb6ee4b0ddfe7a26b823"},"imgCondition":"b","submitTime":{"$numberLong":"1459878759306"},"elapsedTime":"143.89","code":866,"myVals":{"val":"Inefficient use of space. Organization lacking. Too many ads."},"vals":[],"stack":[]}
{"_id":{"$oid":"5703fb7ce4b0ddfe7a26b8b4"},"imgCondition":"b","submitTime":{"$numberLong":"1459878774508"},"elapsedTime":"81.82","code":868,"myVals":{"val":"I think you should change the colors they look a little dual to me you should pick colors that brighten the picture"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703fbd2e4b0b080c4f667bc"},"imgCondition":"b","submitTime":{"$numberLong":"1459878865390"},"elapsedTime":"100.98","code":872,"myVals":{"val":"I feel like the site jumps out at you. ALl the information is nicely stacked on the left. A mnice motto in the middle. Some other less than important things on the bottom right if you're new and don't care about. And some banner ads to visit. A search bar to quickly find what you need and a quick links navigation bar. I think it looks fairly nice for that type of site"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703fd11e4b0b080c4f6762d"},"imgCondition":"b","submitTime":{"$numberLong":"1459879180360"},"elapsedTime":"345.32","code":878,"myVals":{"val":"Increase font size, so that it can be easily readable.\nReduce the size of the picture and give more space to the information.\nWhen a new news item comes, it  can be placed in the bottom \"as the latest news....\" caption so that it can be easily identified.\n"},"vals":[],"stack":[]}
{"_id":{"$oid":"5703ff91e4b0b080c4f68e62"},"imgCondition":"b","submitTime":{"$numberLong":"1459879825009"},"elapsedTime":"91.52","code":890,"myVals":{"val":"It appears very straight forward, lots of green on the page which suggests green is the color for the college. Has obvious links to figure out where you need to go once you access this page. It is easy to read and easy to know where to go from there.  "},"vals":[],"stack":[]}
{"_id":{"$oid":"570406f6e4b0b080c4f7327e"},"imgCondition":"b","submitTime":{"$numberLong":"1459881718368"},"elapsedTime":"81.55","code":907,"myVals":{"val":"The left menu bar is too wide. No need for it to fit the entire logo width. The bottom graphics on the left look like ads, so I didn't even want to look at them. You have a header with links, a sidebar with links, and a quick links bar, not to mention all the lengths in the body. Having actual content on the homepage would be great."},"vals":[],"stack":[]}
{"_id":{"$oid":"57040d7be4b0ddfe7a277986"},"imgCondition":"b","submitTime":{"$numberLong":"1459883388654"},"elapsedTime":"55.69","code":918,"myVals":{"val":"I like the design, though there are a few things I would recommend changing. One, it's a lot of green. The words at the bottom right could also be a bit bigger and better designed. "},"vals":[],"stack":[]}
{"_id":{"$oid":"57043173e4b0b080c4f957dc"},"imgCondition":"b","submitTime":{"$numberLong":"1459903400740"},"elapsedTime":"8.13","code":951,"myVals":{"val":""},"vals":[],"stack":[]}
{"_id":{"$oid":"57043bd0e4b0ddfe7a2a137f"},"imgCondition":"b","submitTime":{"$numberLong":"1459895246970"},"elapsedTime":"58.38","code":963,"myVals":{"val":"The text is too small. There is too much to read and its hard to differentiate between the relative importance of items. "},"vals":[],"stack":[]}
{"_id":{"$oid":"57044ddde4b0ddfe7a2b00d2"},"imgCondition":"b","submitTime":{"$numberLong":"1459899857095"},"elapsedTime":"176.88","code":992,"myVals":{"val":"have more of the information and links at the left side of the site and not at the bottom. i would put the \"get started here\" link at the very top of the page and make the letters much larger. Also, maybe show more pictures of students and faculty."},"vals":[],"stack":[]}
{"_id":{"$oid":"570463ade4b00372f44dcde4"},"imgCondition":"b","submitTime":{"$numberLong":"1459905500980"},"elapsedTime":"161.40","code":1019,"myVals":{"val":"-Too much 1 color (green)\n-I can't see the add words very well at the bottom left part of the screen (the date)\n-A \"contact us\" link should be included in the quick links somewhere on the page\n"},"vals":[],"stack":[]}
{"_id":{"$oid":"570468fae4b000c454b03ce5"},"imgCondition":"b","submitTime":{"$numberLong":"1459906810749"},"elapsedTime":"321.58","code":1025,"myVals":{"val":"When the image first came on the screen, my first thought was that it was for Girl Scout Cookies. (Sorry!) To be honest, this really does not give the impression of an institution of higher learning, but more of a club. Maybe toning down the color scheme and showing more of a college type image rather than a young girl in a tee shirt would give a better, more formal/professional impression. "},"vals":[],"stack":[]}
{"_id":{"$oid":"57046c16e4b00372f44e2142"},"imgCondition":"b","submitTime":{"$numberLong":"1459907603223"},"elapsedTime":"145.18","code":1032,"myVals":{"val":"The colors does not go well together.Green color does not suite for this site.Because of the color the site is not attractive or grab our attention."},"vals":[],"stack":[]}
{"_id":{"$oid":"5704915ae4b00372f45018da"},"imgCondition":"b","submitTime":{"$numberLong":"1459917142035"},"elapsedTime":"280.88","code":1076,"myVals":{"val":"I think the bottom portion could use some filling-out, and some color.  Right now, it looks like one of those pages you get when you type in the wrong address for a website, and GoDaddy, or whoever is advertising for the domain name to be bought.  The Bottom right-hand section that's gray looks like those deceptive advertisement links that are so ubiquitous on the net.   "},"vals":[],"stack":[]}
{"_id":{"$oid":"5704a960e4b00372f4514386"},"imgCondition":"b","submitTime":{"$numberLong":"1459923289773"},"elapsedTime":"175.12","code":1108,"myVals":{"val":"Face should be more attractive and need multi colour "},"vals":[],"stack":[]}
{"_id":{"$oid":"5704ab90e4b000c454b27e2d"},"imgCondition":"b","submitTime":{"$numberLong":"1459923854358"},"elapsedTime":"304.55","code":1116,"myVals":{"val":"Below in the news and campus events red color fonts are used it is not look good use font color white .\nand in the left side at bottom the last part are not looking good please use the different image .\nat left side - coming to parkland is in green color use the black color.\n"},"vals":[],"stack":[]}
{"_id":{"$oid":"5704ac77e4b000c454b28178"},"imgCondition":"b","submitTime":{"$numberLong":"1459923978329"},"elapsedTime":"266.07","code":1117,"myVals":{"val":"I feel like there is a lot of small text all over this page and it's a little hard to find what you need right away. I think the \"In the News\" and \"Campus Events\" don't really necessarily need to be displayed on the home page, they just kind of add clutter to an already busy page. The layout with the different boxes feels a little unorganized and the ads on the left side are a little strange as well. I would make the subjects on top in the dark green boxes a lot bigger since they are probably the most important and what people will be searching for the most. "},"vals":[],"stack":[]}
{"_id":{"$oid":"5704b517e4b000c454b2fdc5"},"imgCondition":"b","submitTime":{"$numberLong":"1459926298710"},"elapsedTime":"544.37","code":1127,"myVals":{"val":"The Design of the website is good and accurate, but still it need some more improvement, description are below.\n1) It is good to see the Video of any grand events or any similar to this is more attractive than a plain Homepage.\n2) The Student Life section should looks more familiar.\n3) The Webpage looks good if you add site map/navigation for your address, this will help full for far away students to reach-out without any interference.\n4) Add more Section or Headlines\n5) Add Feedback Section for Student Life."},"vals":[],"stack":[]}
{"_id":{"$oid":"5704ba6ee4b00372f45184bb"},"imgCondition":"b","submitTime":{"$numberLong":"1459927661694"},"elapsedTime":"87.55","code":1133,"myVals":{"val":"I think they could make it look a bit more professional in order to attract students. To me, the fonts and layout are a bit juvenile and not college looking"},"vals":[],"stack":[]}
{"_id":{"$oid":"5704ba95e4b000c454b3138c"},"imgCondition":"b","submitTime":{"$numberLong":"1459927696867"},"elapsedTime":"233.26","code":1134,"myVals":{"val":"Links for older Achievements can be provided.Also \"Contact us\" link which re-directs to phone number and email address should be provided."},"vals":[],"stack":[]}
{"_id":{"$oid":"57051f11e4b0d5ef28c103c6"},"imgCondition":"b","submitTime":{"$numberLong":"1459953428335"},"elapsedTime":"55.81","code":1213,"myVals":{"val":"design is absolutely good and entertaining and it looks attractive.Nothing should be improved in my opinion."},"vals":[],"stack":[]}
