{"_id":{"$oid":"56d74d73e4b040bdab1da4a6"},"imgCondition":"c","submitTime":{"$numberLong":"1456950642515"},"elapsedTime":"125.37","code":"1090","myVals":{"val":"It looks a little washed out. Maybe add more colors. Make it so you can add subcategories like fantasy football, golf friends, etc. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d74e56e4b040bdab1dad23"},"imgCondition":"c","submitTime":{"$numberLong":"1456950873690"},"elapsedTime":"132.44","code":"5336","myVals":{"val":"I like the design. It looks like a cross between social media such as facebook and paypal. I think it is very good as is and can't really think of a good suggestion."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d75bede4b040bdab1e3086"},"imgCondition":"c","submitTime":{"$numberLong":"1456954318530"},"elapsedTime":"153.20","code":"8744","myVals":{"val":"The website is too bland try to make it more appealing to user maybe by adding a different color. Also have some faces on the profile pics it makes it feel as if bots are running the website instead of actual humans. You should also have a bonus for people who refer their friends to use this app."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d76f5be4b08487d2a5d334"},"imgCondition":"c","submitTime":{"$numberLong":"1456959087298"},"elapsedTime":"88.88","code":"6875","myVals":{"val":"In my opinion, every things stands perfect"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d77695e4b040bdab1f2152"},"imgCondition":"c","submitTime":{"$numberLong":"1456961178868"},"elapsedTime":"107.70","code":"9783","myVals":{"val":"design is good. displaying amount will be sounds good."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d77847e4b040bdab1f3029"},"imgCondition":"c","submitTime":{"$numberLong":"1456961643479"},"elapsedTime":"59.24","code":"8812","myVals":{"val":"This site looks well-designed, and it looks easy to use."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d77e70e4b08487d2a65a5c"},"imgCondition":"c","submitTime":{"$numberLong":"1456963188029"},"elapsedTime":"266.98","code":"8102","myVals":{"val":"I don't see the purpose of having a stream of friend's payments. I would much rather the homepage look like Paypal's and focus on my own information. Default to show all my transactions, especially pending payments and charges made to others. Also the bar for pay or charge should be expanded to separate the amount and the other person involved. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d77e82e4b040bdab1f6647"},"imgCondition":"c","submitTime":{"$numberLong":"1456963204561"},"elapsedTime":"50.59","code":"3541","myVals":{"val":"This design is not attractive.The blue color should be change to bright orange color with appropriate background color.Flashing ads like lowest fees should be flashing.The web page is simple and clutter free.There are no other details in it. Please improve it with further details with bright colored fonts.\n"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d786b1e4b08487d2a69d76"},"imgCondition":"c","submitTime":{"$numberLong":"1456965297324"},"elapsedTime":"109.69","code":"8325","myVals":{"val":"The webpage design seems to be very easy to use. It os organized and everything is laid out in pretty obvious positions that make the page easy to understand and use. I think that the page has a bit too much white or blank space though. These areas could be filled in with anything from stretching the information to just placing ads or other links here."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d78fcde4b08487d2a6f19c"},"imgCondition":"c","submitTime":{"$numberLong":"1456967627229"},"elapsedTime":"1802.02","code":"7850","myVals":{"val":"Worst design ever. So so low class. This is a disaster. So 90s. Get rid of this fast."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7924ce4b040bdab20172f"},"imgCondition":"c","submitTime":{"$numberLong":"1456968262320"},"elapsedTime":"31.74","code":"3671","myVals":{"val":"Overall the website is not bad.The background theme is good.The fonts is also good to watch.But the arrangements of the titles and menu is not to good."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d79a58e4b08487d2a74fe2"},"imgCondition":"c","submitTime":{"$numberLong":"1456979322189"},"elapsedTime":"673.22","code":"7096","myVals":{"val":"On the right hand side of the page, instead of finding friends by clicking on the friends link, it would be advisable to make a drop down for the friends available in the list. So that, when one hovers over the link, the drop down of friends would appear which in my opinion would make transferring money time efficient. Secondly the settings link at the top right hand corner could be replaced by messages link which would let us know whether the cash has been successfully transferred or not."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7a764e4b08487d2a7d153"},"imgCondition":"c","submitTime":{"$numberLong":"1456973663654"},"elapsedTime":"297.66","code":"6042","myVals":{"val":"Some currency image would have shown on the top to make them understand that it is related to money"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7a78ae4b040bdab20da93"},"imgCondition":"c","submitTime":{"$numberLong":"1456973703322"},"elapsedTime":"335.90","code":"4687","myVals":{"val":"The picture colour is not clear.If the colour of the picture is clear, the design will be very good.There are only 2 to 3 colours in the design, the number of colours can be improved to make the design attractive."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7abfde4b08487d2a7fb58"},"imgCondition":"c","submitTime":{"$numberLong":"1456974849748"},"elapsedTime":"292.96","code":"8929","myVals":{"val":"Seems to be very utilitarian. There is very little in the way of aesthetics on  the page, and maybe that is the intent. I'm assuming the pictures are blanked out for the purposes of the study only, but it would probably affect the interpretation of the page in a positive way if we could see how the pictures enhance the page. Color scheme is somewhat bland."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7b670e4b08487d2a85dc5"},"imgCondition":"c","submitTime":{"$numberLong":"1456977519040"},"elapsedTime":"576.43","code":"2539","myVals":{"val":"I would like to see, on this page, pending payments (from me and due to me) tied to calendar events. Also, need the ability to split a specific payment amount among a group of friends equally, without having to calculate that myself. Also, I hope that when friend X pays friend Y for something, my ability to see it is governed by privacy settings - e.g. I am able to see above who paid to whom, when I am not part of that transaction. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7b8ebe4b040bdab21769a"},"imgCondition":"c","submitTime":{"$numberLong":"1456978149376"},"elapsedTime":"113.15","code":"5332","myVals":{"val":"It is not colourful to attract  viewers to this. Looks simple and easy to use."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7c2fae4b040bdab21cadb"},"imgCondition":"c","submitTime":{"$numberLong":"1456980723484"},"elapsedTime":"27.10","code":"7657","myVals":{"val":"I think more color is needed, too dull looking"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7d82ee4b08487d2a94fc3"},"imgCondition":"c","submitTime":{"$numberLong":"1456986588857"},"elapsedTime":"163.66","code":"8279","myVals":{"val":"The design is pretty simple and easy to understand. However, I think it would be better if images of each of the people is attached with their profile."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7dad4e4b08487d2a95e3b"},"imgCondition":"c","submitTime":{"$numberLong":"1456986828687"},"elapsedTime":"84.35","code":"1768","myVals":{"val":"Design is good.Nothing more to improve.Thanks"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7e030e4b04e66beba3beb"},"imgCondition":"c","submitTime":{"$numberLong":"1456988209852"},"elapsedTime":"210.99","code":"6870","myVals":{"val":"I like the colors of the design and overall layout is good. I don't think the rounded buttons for Public, Friends or Mine stand out enough, they feel kind of flat. I think rectangular buttons with icons in that bar would be better suited."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7e6c5e4b04e66beba5c17"},"imgCondition":"c","submitTime":{"$numberLong":"1456989889462"},"elapsedTime":"525.52","code":"1790","myVals":{"val":"This application is used to transfer amount to each other. But i had a small doubt in this system we can only charge/ pay  only for friends who using this account or we can pay/ charge directly in bank account. i wish to add a point to improve the design methods just organised the icons and add some photos related to amount like penny/ dollars and so. Thank you for this opportunity.  "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7fddae4b04e66bebabe55"},"imgCondition":"c","submitTime":{"$numberLong":"1456995801256"},"elapsedTime":"30.15","code":"3455","myVals":{"val":"Change the layout. Have social media links at bottom"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7fed1e4b04e66bebac1a7"},"imgCondition":"c","submitTime":{"$numberLong":"1456996059856"},"elapsedTime":"638.92","code":"8907","myVals":{"val":"1.The logo and name of the event should be separate as its very difficult to find what is the name of organization and the event name\n2.Time , date and address don't need to take too much attention as we can move that to bottom\n3.Some information about the event, chief guest of the event and price offered should be detailed. \n4.contact information about the organizer should be valuable in the design for public to clarify their doubt"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d80920e4b04e66bebae7fe"},"imgCondition":"c","submitTime":{"$numberLong":"1456998687885"},"elapsedTime":"258.70","code":"4626","myVals":{"val":"I like the overall layout of the page. I think I would like it more with a little more color."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d83050e4b0f13d26d01172"},"imgCondition":"c","submitTime":{"$numberLong":"1457008718846"},"elapsedTime":"159.73","code":"5360","myVals":{"val":"At the top right, I would add a section called \"Account.\" I would like to be able to see where I have sent my money and what money was sent to me. Settings to me just makes me think about making the interface look different. Also, maybe you can mention what type of payment it is. Is it USD, or Euro, etc. Overall, it's a very simple and clean interface. I really like it."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d83079e4b0f13d26d012a4"},"imgCondition":"c","submitTime":{"$numberLong":"1457008723048"},"elapsedTime":"206.33","code":"9316","myVals":{"val":"The design is fair.  I don't see anything that shows how secure your payment is.  I would be very scared to use this app to transfer money to someone.  It doesn't really show how much money was transferred each time either.  It looks more like a facebook page than an app to transfer money.  I think it needs to look more secure and provide signs of security and amounts of transactions.  It looks more like a social app for friends to talk."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d83e68e4b04e66bebc48a2"},"imgCondition":"c","submitTime":{"$numberLong":"1457012327389"},"elapsedTime":"295.33","code":"9954","myVals":{"val":"The design very much looks like Facebook but in a different type of blue color. The word \"paid\" looks fine but \"charged\" doesn't really sound good. \"Charged\" should be replaced with something else, like repaid or reimbursed. It doesn't look cool to take up so much space for the \"Invite Friends\" option, Instead, it should just be in a single line like \"Invite Friends?\"."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d85932e4b0f13d26d17883"},"imgCondition":"c","submitTime":{"$numberLong":"1457019182741"},"elapsedTime":"150.59","code":"9829","myVals":{"val":"I'm a big fan of the design. Very simple, straight forward, and user-friendly. Everything is self explanatory. While the design is 'fun,' it isn't childish. I feel like, with a lot of \"new\" apps \u0026 websites, this is a hard thing to balance for companies/designers. A lot of times companies try to go with a 'fun' design that [in my opinion] ends up looking very child-like. With a design like seen above, I could see all age groups being interested/comfortable with the overall feel. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d85e59e4b0f13d26d1a5f7"},"imgCondition":"c","submitTime":{"$numberLong":"1457020504573"},"elapsedTime":"65.28","code":"4581","myVals":{"val":"the design looks clean and well thought out"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d86eabe4b04e66bebe1227"},"imgCondition":"c","submitTime":{"$numberLong":"1457024695695"},"elapsedTime":"164.93","code":"7399","myVals":{"val":"the design of the buttons can be changed and ratings option can be included in it "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d87527e4b0f13d26d2835b"},"imgCondition":"c","submitTime":{"$numberLong":"1457026345092"},"elapsedTime":"89.30","code":"5742","myVals":{"val":"I like it a lot! I think it's neat that you can site what you're paying back someone for. I think that I would like to have more information on the sidebar about what's pending and what has been spent, but other than that, this is actually really neat. I could easily see using this much more than Paypal."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d89592e4b0f13d26d3ce03"},"imgCondition":"c","submitTime":{"$numberLong":"1457034645881"},"elapsedTime":"64.75","code":"2598","myVals":{"val":"i liked it. no avatars here?"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d8b28de4b04e66bec0b7a9"},"imgCondition":"c","submitTime":{"$numberLong":"1457042062347"},"elapsedTime":"76.03","code":"3645","myVals":{"val":"Clean, easy to read. Background could use some texture (*subliminal usage). Chat boxes seem too short. Perhaps this was designed first for mobile interfaces. Blue color is calming, professional. "},"vals":[],"stack":[]},
,