{"_id":{"$oid":"56d74e15e4b08487d2a49484"},"imgCondition":"b","submitTime":{"$numberLong":"1456950802103"},"elapsedTime":"270.57","code":"4276","myVals":{"val":"I think the term \"college resources\" is vague and does not do a good job of communicating to the user what information that link leads to.  I find the site very plain and somewhat dull.  The font is boring and the two sections on the bottom right \"In the News\" and \"Campus Events\" are easy to overlook.  The grey and orange color scheme of these boxes is not visually enticing."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d74e62e4b040bdab1dada8"},"imgCondition":"b","submitTime":{"$numberLong":"1456950871463"},"elapsedTime":"160.68","code":"3551","myVals":{"val":"It looks really good I would just want to see some success stories from students and also some pictures of the campus sites so I can see what it is like. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d75023e4b040bdab1dbf8d"},"imgCondition":"b","submitTime":{"$numberLong":"1456951331080"},"elapsedTime":"99.94","code":"3814","myVals":{"val":"Color use could be better, angles appear harsh. Too much information in different parts of page"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d751d2e4b08487d2a4b982"},"imgCondition":"b","submitTime":{"$numberLong":"1456951759792"},"elapsedTime":"233.27","code":"3598","myVals":{"val":"The design of the webpage is pretty good but lot too much information is provided on the single page itself. The drop down button for the quicklinks does not seems important considering the left side reading pane and details on page top. \n\nYou could either use detailing on top or on left to make webpage more appealing"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d752a8e4b040bdab1ddd22"},"imgCondition":"b","submitTime":{"$numberLong":"1456951974723"},"elapsedTime":"446.24","code":"3030","myVals":{"val":"This is a really clean design; it's easy to understand and seems easy to navigate. As far as I can tell everything that a prospective student would need to research should be accessible from this page, although I have to admit that my experience with college websites is practically nil; I graduated before there was an internet.\n\nI like the colors used; are these the university colors? It's possible that some people might think there's too much green but it doesn't bother me. About the only suggestion I could make would be an option to view the site in a different language, for international students, but I'm not familiar with this school so maybe that's not a priority there."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d753d2e4b08487d2a4ce10"},"imgCondition":"b","submitTime":{"$numberLong":"1456952279231"},"elapsedTime":"64.61","code":"7220","myVals":{"val":"To much green which takes away from being able to see the red print to the bottom right.  Distorts viewing."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7555ce4b08487d2a4dc08"},"imgCondition":"b","submitTime":{"$numberLong":"1456952669537"},"elapsedTime":"109.99","code":"4541","myVals":{"val":"I think the entire design is too outdated. The layout does not look modern. It need to look more lively. Most universities have front pages that look more lively and modern than this. Green is usually avoided as the dominant color. The information on the left and the topics at the top should be consolidated into one section. News and campus events should be presented as a slideshow, not text."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d76f1ae4b040bdab1edeab"},"imgCondition":"b","submitTime":{"$numberLong":"1456959255230"},"elapsedTime":"73.77","code":"1705","myVals":{"val":"There should be a Contact Us, so that Students can contact for any queries"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d78c16e4b08487d2a6d110"},"imgCondition":"b","submitTime":{"$numberLong":"1456966678164"},"elapsedTime":"81.57","code":"2596","myVals":{"val":"The color (bright green) is wrong for an educational institution.  I think the picture on the right hand side should be smaller, and the \"Information For\" area a little bigger to make it easier to read."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7b294e4b08487d2a83895"},"imgCondition":"b","submitTime":{"$numberLong":"1456976076371"},"elapsedTime":"590.25","code":"8370","myVals":{"val":"Critics\n=====\n1. The design seems to very old and unattractive.\n2. The colour looks very boring and also the website looks like fake due to missing \"contact us link\".\n3. The \"Google custom\" search seems to be very unpleasant in website.\n\nSuggestions\n========\n1. Please change the theme and layout to modern theme which makes the website dynamic and attractive.\n2. Please add \"contact us\" link.\n3. Please remove the links from the left sidebar and replace it with dropdown menus."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7c469e4b08487d2a8cff2"},"imgCondition":"b","submitTime":{"$numberLong":"1456981099256"},"elapsedTime":"415.83","code":"9738","myVals":{"val":"Images and Graphics looks poor and are not appealing enough. Home page should show college campus to get first good impression of it.Usually good appealing websites shows loading images on front page one after another automatically with some time intervals."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7d9cde4b08487d2a9592f"},"imgCondition":"b","submitTime":{"$numberLong":"1456986569436"},"elapsedTime":"1207.34","code":"5649","myVals":{"val":"(1)  The left menu items are little confusing to identify the content. I guess it looks good, if each menu item has a right arrow by showing the sub menu items .\n(2)  The font of the design layout is not appealing. A website should have an clear font family and font size prior to the background.\n(3)  The great image (center image with a smiley woman) is not much appealing and does not outfit to a college website.\n(4)  The events and News are good, but similar the font face need to be changed prior the background."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7ddc8e4b040bdab2284a5"},"imgCondition":"b","submitTime":{"$numberLong":"1456987654650"},"elapsedTime":"153.62","code":"9681","myVals":{"val":"The information is clustered together making it look not attractive. It should be appealing..."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7eb59e4b0f13d26ceb76f"},"imgCondition":"b","submitTime":{"$numberLong":"1456991047761"},"elapsedTime":"127.74","code":"2180","myVals":{"val":"It's kind of asymmetrical, it looks like several different sized boxes were just stuck together at random. The colors are ugly, there's too much bright green and drab brown,  The links on the bottom right look generic, almost like they're from some kind of spam/redirect site. I'd basically try to make it more seamless, more symmetrical, and change the font and color of those links on the bottom right."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7fad7e4b04e66bebab449"},"imgCondition":"b","submitTime":{"$numberLong":"1456995000993"},"elapsedTime":"349.60","code":"8998","myVals":{"val":"The design seems ok with the lady in the photo,but may allow me to say that little more clarity (in colour) may be a good idea.Not  suggesting changing  the person for that matter,but something needs to say about picture colour-it do post a GREY  look.The change in overall colour pattern  will make the site more attractive."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7fec3e4b04e66bebac171"},"imgCondition":"b","submitTime":{"$numberLong":"1456995980080"},"elapsedTime":"287.23","code":"9499","myVals":{"val":"The column on the left side is too wide, which leaves visible empty space next to the text.  If the column is unable to be narrowed, I would prefer the font of the text to be larger.  The composition of the center image is awkward, I would prefer either the arrow not pointing straight at the person's face and it be a bit smaller.    "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d805b1e4b0f13d26cf1dd3"},"imgCondition":"b","submitTime":{"$numberLong":"1456997807953"},"elapsedTime":"546.92","code":"771.","myVals":{"val":"You may want to add \"jobs\" to the category selection. I also think a picture of a group of students might make a better website picture. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d81059e4b04e66bebb02a3"},"imgCondition":"b","submitTime":{"$numberLong":"1457000536183"},"elapsedTime":"310.58","code":"9084","myVals":{"val":"1.The Main banner ( Go ahead and grow) is too big , it should be smaller leaving more space for other information.\n2. Also , I cant see a translation link so I am assuming its for only English speaking students. \n3.The panel at the bottom left is blank and this should not be so. \n4.Finally the 'Coming to Parkland , Get started panel should be at the topmost left'. People ( English speaking people) read from left to right and top to bottom. I believe this link will be what most first timers will be interested in so it should have more prominence. \nAll the best."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d81ac7e4b0f13d26cf7dcb"},"imgCondition":"b","submitTime":{"$numberLong":"1457003200563"},"elapsedTime":"151.55","code":"2197","myVals":{"val":"The left side of website is holding up lots of space and it can be reduced\nThe Google custom search is looking prominent,it can placed at extreme right corner"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d81af7e4b04e66bebb3f97"},"imgCondition":"b","submitTime":{"$numberLong":"1457003258135"},"elapsedTime":"131.22","code":"2913","myVals":{"val":"The background color combination is good. Fonts are readable. Links are arranged well. Left bottom corner's portion is not clear and can't readable. Better to do something to make clear in that area."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d82156e4b04e66bebb6bf4"},"imgCondition":"b","submitTime":{"$numberLong":"1457004881727"},"elapsedTime":"126.30","code":"4970","myVals":{"val":"I like the fact that the campus events are included. However the Shakespeare part on the bottom left is a little hard to read. I also feel like the \"coming to Parkland\" link should be higher on the page so that it is easier to find and locate for future students."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d82696e4b04e66bebb9159"},"imgCondition":"b","submitTime":{"$numberLong":"1457006229905"},"elapsedTime":"119.29","code":"4688","myVals":{"val":"Logo should be medium size.\nNews and Events sections must be left or right side.\nYou have to keep Career and Contact us sections on the main page."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d82faee4b0f13d26d008b8"},"imgCondition":"b","submitTime":{"$numberLong":"1457008596037"},"elapsedTime":"324.68","code":"2786","myVals":{"val":"The overall design appears to be good. I would have preferred a photo of the classrooms/students or a slide show of various photographs related to the college. You can add a page for alumni of the college. Other menu options are well thought of.  'Coming to parkland? Get started here' link should have necessary syllabi for various courses and facility for applying online."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d845d4e4b0f13d26d0c796"},"imgCondition":"b","submitTime":{"$numberLong":"1457014227824"},"elapsedTime":"100.46","code":"2067","myVals":{"val":"There is too much noise on the page. tabs should all be loacted in one central area so that people can find what they need and be done. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d84c3be4b0f13d26d106a8"},"imgCondition":"b","submitTime":{"$numberLong":"1457015865703"},"elapsedTime":"270.69","code":"3210","myVals":{"val":"The punch line should be changed and made a bit more catchy as the target audience is current and future students.What all it offers should be a bit highlighted so that it catches the attention of students looking for doing a course"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d85e62e4b04e66bebd75c3"},"imgCondition":"b","submitTime":{"$numberLong":"1457020528189"},"elapsedTime":"98.21","code":"6862","myVals":{"val":"Models in this design should look like a students"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d85e81e4b0f13d26d1a790"},"imgCondition":"b","submitTime":{"$numberLong":"1457020915729"},"elapsedTime":"137.67","code":"4683","myVals":{"val":"I think the overall design is good. The headings are clear and simple to understand. The one change I would suggest is under the campus events section, instead of just listing the vents, use a calendar that has each event on it so people can see both the date and day of the event and then click on the event for more information."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d865dbe4b0f13d26d1f26b"},"imgCondition":"b","submitTime":{"$numberLong":"1457022436953"},"elapsedTime":"114.25","code":"6408","myVals":{"val":"There are too many things going on. I dont know where to look at first."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d8820fe4b04e66bebedc5d"},"imgCondition":"b","submitTime":{"$numberLong":"1457029647302"},"elapsedTime":"284.27","code":"8723","myVals":{"val":"If I looking for information on this college and needed more information, this design would be great. I like that information section is easy to find and the tabs about what student life is like at the college. This site seems easy to navigate and I wouldn't have to guess where to find things. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d891c0e4b04e66bebf7764"},"imgCondition":"b","submitTime":{"$numberLong":"1457033663455"},"elapsedTime":"269.51","code":"7228","myVals":{"val":"-I really don't like so much green, its hard on the eyes. I suggest using a more neutral color. \n-Picture of the girl doesn't really have any content or context. She's just there without a purpose\n-My eyes are automatically directed to the big box with the girl. Maybe put most pertinent information there. \n-The boxes with news and campus are a nice feature, looks like they offer quick access to useful info\n-overall, I like the compartmentalization, however  the biggest compartment is pointless.\n"},"vals":[],"stack":[]},
,