{"_id":{"$oid":"56d74eb4e4b040bdab1db173"},"imgCondition":"a","submitTime":{"$numberLong":"1456950962454"},"elapsedTime":"118.26","code":"4858","myVals":{"val":"It's an eye-catching design, with a good graphic.  I like the color and the bold print.  The only real change I could suggest would be to make it clearer that it is for ballroom dancing.  The type of dancing should be bolder and closer to the top."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d75276e4b08487d2a4bff8"},"imgCondition":"a","submitTime":{"$numberLong":"1456951925819"},"elapsedTime":"86.56","code":"5693","myVals":{"val":"The paragraph at the bottom left could be substituted with bullet. Ex:  .Join US   .Free Lessons."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d75472e4b08487d2a4d3e4"},"imgCondition":"a","submitTime":{"$numberLong":"1456952435697"},"elapsedTime":"275.40","code":"9980","myVals":{"val":"Post the different styles of ballroom dance\nUpdate the poster when you have the second location determined\nTell us who is performing if they are reasonable representatives\nOther than that I honestly like the general design of the poster, the soft lavenderish color complements the yellow text rather well."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d755e5e4b040bdab1dfb4b"},"imgCondition":"a","submitTime":{"$numberLong":"1456952806322"},"elapsedTime":"228.69","code":"1182","myVals":{"val":"Good except for two different dates for same event or different? Dancesport Dance seems seems a repeat, doesn't tell much."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7560de4b08487d2a4e22b"},"imgCondition":"a","submitTime":{"$numberLong":"1456952845126"},"elapsedTime":"89.15","code":"1452","myVals":{"val":"When first looking at this design, I notice the colors. The black with purple does not POP. I would add a more colorful and light background color, preferably white with red instead of purple and the words black. I would change the font style to something more cursive like to give it more of a fancy feel."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d75efbe4b040bdab1e4c1f"},"imgCondition":"a","submitTime":{"$numberLong":"1456955095784"},"elapsedTime":"128.33","code":"9637","myVals":{"val":"It  is nice and very attractive. It is simply but all information provide this poster."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d76edbe4b040bdab1edc8d"},"imgCondition":"a","submitTime":{"$numberLong":"1456959195036"},"elapsedTime":"32.99","code":"8445","myVals":{"val":"It's a good advertisement and I like the colors"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d77791e4b040bdab1f2ade"},"imgCondition":"a","submitTime":{"$numberLong":"1456961482584"},"elapsedTime":"140.72","code":"9544","myVals":{"val":"I think it's a very eye catching design.  I like the colors.  The only thing I would do, is to make the font size of the last four sentences larger.  I think it should be placed a little lower, and made bigger.  "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d78438e4b040bdab1f9811"},"imgCondition":"a","submitTime":{"$numberLong":"1456964663368"},"elapsedTime":"183.07","code":"6106","myVals":{"val":"Its pretty but it looks like it's designed to appeal to an older age group rather than college kids. I think adding some more color would help."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d78595e4b08487d2a69473"},"imgCondition":"a","submitTime":{"$numberLong":"1456965006052"},"elapsedTime":"86.97","code":"1781","myVals":{"val":"picture was not so good ,background color is so black it was not attractive letters color too must change"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7a192e4b08487d2a79aa9"},"imgCondition":"a","submitTime":{"$numberLong":"1456972202812"},"elapsedTime":"132.57","code":"2845","myVals":{"val":"The design is very interesting and make a feeling to attend the show. It attracts the people. Very innovative design."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7abb0e4b040bdab20fe03"},"imgCondition":"a","submitTime":{"$numberLong":"1456974765373"},"elapsedTime":"264.52","code":"5776","myVals":{"val":"I think the design does not look exciting. I think the picture should be more lively and catch people's attention. And maybe change the back ground to be more fun. Black looks too gloomy and boring."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7b8a6e4b08487d2a8710e"},"imgCondition":"a","submitTime":{"$numberLong":"1456978079052"},"elapsedTime":"248.11","code":"7133","myVals":{"val":"Little more clear information is required to be given in the design.   Time and place should be given little more attention.  Ball room dance picture is a good one.\nIf it is possible to change the name from OPEN HOUSE 2015 to SPLENDID DANCE HOUSE 2015."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7bea9e4b08487d2a8a287"},"imgCondition":"a","submitTime":{"$numberLong":"1456979628691"},"elapsedTime":"336.62","code":"7899","myVals":{"val":"The designing which is given here is not so attractive and changing these design should be better. Its not so good. I am telling you so frankly. The used font and colour are also want to change for this for the better look."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7c2e4e4b040bdab21c8fc"},"imgCondition":"a","submitTime":{"$numberLong":"1456980701472"},"elapsedTime":"77.56","code":"8910","myVals":{"val":"SIMPLE AND GOOD."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7cb50e4b08487d2a8ff85"},"imgCondition":"a","submitTime":{"$numberLong":"1456982863012"},"elapsedTime":"292.62","code":"5951","myVals":{"val":"The message about the free dance lessons should be easily noticeable, another thing is this is a poster for dance show, so it will be better if the poster is more colorful. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7cf25e4b040bdab2223ff"},"imgCondition":"a","submitTime":{"$numberLong":"1456983845062"},"elapsedTime":"247.97","code":"3226","myVals":{"val":"The design is good but a poor color selection.  The name is not clear.  The words look connected at the top.  Overall those are the only things I see that need improvement."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7d2ffe4b040bdab223fda"},"imgCondition":"a","submitTime":{"$numberLong":"1456985041320"},"elapsedTime":"224.59","code":"5945","myVals":{"val":"This design is jus an average one, you can improve by changing font styles and including some awesome footage texture , change the background texture,  do it in adobe after effects that software will help you to add some modern stylish effect to your design . just search in youtube for new after effect tips, i'm sure you can improve this"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7d82ee4b08487d2a94fc2"},"imgCondition":"a","submitTime":{"$numberLong":"1457034827058"},"elapsedTime":"366.60","code":"6574","myVals":{"val":"Overall the design looks so dull due to the colour combination. Lavender colour doesn't suit this design. If red and white is used it will be more attractive. Colourful costume of the dancing boy and  girl can make this design more live. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7d9f1e4b040bdab22715a"},"imgCondition":"a","submitTime":{"$numberLong":"1456986608579"},"elapsedTime":"348.01","code":"8742","myVals":{"val":"This is a very good design.  It is clear and concise.  The graphics are simple yet they communicate effectively what the event is all about.  The black background make the poster eye-catching and dramatic, which is a nice fit for ballroom dancing.  A phone number or website should be included for people to gain more information, particularly those wishing to be updated on the location of Tuesday's event."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7dee7e4b08487d2a97c48"},"imgCondition":"a","submitTime":{"$numberLong":"1456987875649"},"elapsedTime":"142.09","code":"6903","myVals":{"val":"that was nice, but you try to make improvement of out look and performance"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7e41de4b0f13d26ce949e"},"imgCondition":"a","submitTime":{"$numberLong":"1456989208764"},"elapsedTime":"165.63","code":"8912","myVals":{"val":"THE COLOUR OF THE BACKGROUND SHOULD BE SOME OTHER COLOUR AND MORE DESIGN WORK SHOULD BE INCLUDED IN THE POSTER.THEN IT WILL BE MORE ATTRACTIVE."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7e584e4b04e66beba56a5"},"imgCondition":"a","submitTime":{"$numberLong":"1456989561723"},"elapsedTime":"483.41","code":"2863","myVals":{"val":"Looks simple it can be more colorful and creative graphic should be more attractive may be a photograph body text placing looks if bottom text can put in the bottom part looks more appealing light yellow color should be replaced with some brighter color after all this is an invitation for a dance party moral of the story is that this design need to be corrected more professional way."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7e7a1e4b0f13d26cea4b2"},"imgCondition":"a","submitTime":{"$numberLong":"1456990101903"},"elapsedTime":"46.09","code":"4018","myVals":{"val":"Instead of this image real image with attractive colours ran be used to improve the task"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7eafae4b0f13d26ceb5f7"},"imgCondition":"a","submitTime":{"$numberLong":"1456990977834"},"elapsedTime":"69.97","code":"5948","myVals":{"val":"THE POSTER SHOULD BE LITTLE MORE ATTRACTIVE IF THE BACKGROUND COLOUR IS DIFEERENT AND SHOULD ADD MORE DESIGN IN THE POSTER AND MAKE IT COLOURFUL."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7f950e4b0f13d26cef3a9"},"imgCondition":"a","submitTime":{"$numberLong":"1456994611676"},"elapsedTime":"29.01","code":"5579","myVals":{"val":""},"vals":[],"stack":[]},
{"_id":{"$oid":"56d7fe4fe4b04e66bebabff1"},"imgCondition":"a","submitTime":{"$numberLong":"1456995916878"},"elapsedTime":"220.19","code":"1104","myVals":{"val":"font size and back ground color may be attractive.the pair male and female dance pose are good.but color can be attractive.back ground color black is little dull.Black and pink color combination makes little normal appearance.not as good look.it can be changed."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d803c5e4b0f13d26cf17b7"},"imgCondition":"a","submitTime":{"$numberLong":"1456997313199"},"elapsedTime":"116.18","code":"8756","myVals":{"val":"Images looks like old style. Better images can be used. The text can be reduced. More text is given at the end. Also the venue and time of the event can be highlighted with better font and color. Default font does not look good in this poster. The word free can be highlighted to grab more viewers."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d80f3fe4b04e66bebafd45"},"imgCondition":"a","submitTime":{"$numberLong":"1457000252148"},"elapsedTime":"263.96","code":"8664","myVals":{"val":"Nice look . The design logo may be some better appearance "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d81200e4b0f13d26cf4cf3"},"imgCondition":"a","submitTime":{"$numberLong":"1457001020169"},"elapsedTime":"283.42","code":"9196","myVals":{"val":"The poster is good but it could have been better if certain things were added to it.1)The names and qualifications of judges could have been added to the poster to make it more attractive.2)The color combination used could have been a bit more lively as the color would have made the poster more attractive.3)Addition of few more dancing figures would have made the poster more attractive."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d82006e4b0f13d26cf9d91"},"imgCondition":"a","submitTime":{"$numberLong":"1457004544681"},"elapsedTime":"459.76","code":"5921","myVals":{"val":"This advertising poster is not colourful Its look like below average program, Its not attractive for youth. Dance performance poster should be in realistic it should be in colourful and also include famous dancers images like film stars or celebrities. It should be make it more attractive for all peoples and also include some little hot pictures. Mentioning program fee is another thing for good attractiveness It should be in reasonable price for all categories of the peoples."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d82dcde4b04e66bebbc5b3"},"imgCondition":"a","submitTime":{"$numberLong":"1457008097170"},"elapsedTime":"154.54","code":"8538","myVals":{"val":"Well designed. Nice looking."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d836c5e4b04e66bebc0ae9"},"imgCondition":"a","submitTime":{"$numberLong":"1457010361183"},"elapsedTime":"80.43","code":"3953","myVals":{"val":"The color is not nice so please change the color of the ad to look more colorful and graceful"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d83c3be4b0f13d26d070e4"},"imgCondition":"a","submitTime":{"$numberLong":"1457011768892"},"elapsedTime":"196.09","code":"4279","myVals":{"val":"The design is appropriately eye-catching. It may be because I'm not familiar with the student organization, but it might be good to have text somewhere that says \"organized by Illini Dancesport\" (assuming that's the name of the student organization). That would make it clearer who the organizing body is. It would also be good to include ending times as well starting times for the events. Some bullet points may be helpful, something like no experience necessary, all experience levels welcome, etc."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d84b0fe4b04e66bebcc335"},"imgCondition":"a","submitTime":{"$numberLong":"1457015563703"},"elapsedTime":"155.24","code":"4156","myVals":{"val":"I think the design is eye catching and depicts the activity appropriately.  It is obvious at first glance that the activity involves dancing.  The only change I might make is to change the color to yellow or white to match the text in the ad."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d857c6e4b0f13d26d16c3f"},"imgCondition":"a","submitTime":{"$numberLong":"1457018871085"},"elapsedTime":"124.19","code":"1832","myVals":{"val":"I think it looks very nice. I like how they use purple on a black back ground. It looks very classy and elegant. I think how you have the TIME/PLACE is very informational, as well as the the location in yellow. Also, I like how it makes it personal by saying \"join us\" and there are options of 4 different styles of ballroom dance. Overall, the entire presentation is very unique and draws the eye in. I adore it. I think one thing to make it better would be to add some gold glitter around the edges. "},"vals":[],"stack":[]},
{"_id":{"$oid":"56d85dcce4b0f13d26d1a10b"},"imgCondition":"a","submitTime":{"$numberLong":"1457020364159"},"elapsedTime":"88.90","code":"8585","myVals":{"val":"I like the colors overall but the layout looks sloppy and the design of the male and female dancers looks really clunky and choppy.  The logo in the top left looks nice but the rest of the layout just seems thrown together at the last minute.  I'd try to make those two characters look more polished and less like they were put together with Microsoft Paint.  The Time/Place is also not properly aligned so make sure everything lines up and looks neat."},"vals":[],"stack":[]},
{"_id":{"$oid":"56d86530e4b04e66bebdb554"},"imgCondition":"a","submitTime":{"$numberLong":"1457022261063"},"elapsedTime":"173.88","code":"5053","myVals":{"val":"should content the organisers credentials"},"vals":[],"stack":[]},
{"_id":{"$oid":"56d89ecae4b0f13d26d42b20"},"imgCondition":"a","submitTime":{"$numberLong":"1457037002656"},"elapsedTime":"75.40","code":"1620","myVals":{"val":"I like it.  It is clear.  Perhaps pick a cleaner dancing couple silhouette."},"vals":[],"stack":[]},
,